
Задание 1.

Задан Series объект s, найти индекс первого элемента отсортированного s, где значения больше 5.

In [ ]:
# задано изначально
import numpy as np
import pandas as pd

r = np.random.RandomState(1)
s = pd.Series(r.uniform(0, 10, 100))

s = sorted(s)
s = pd.Series(s)
# Далее ваше решение
for i in range(len(s)):
  if s[i] > 5:
    print(i)
    break
# s[30:60]

51

In [ ]:
# task 2
# создадим тестовый датасет
df = pd.DataFrame({
    'имя': ['Петя', 'Вася', 'Аня', 'Света'],
    'возраст': [45, 26, 41 , 21],
    'доход': [100000, 80000, 150000, 60000],
    'надежность клиента (0..1)': [0.65, 0.74, 0.87, 0.68],
    'пол': ['муж', 'муж', 'жен', 'жен']},
    index=[0, 1, 2, 3])

df["важность"] = df['доход']*df['надежность клиента (0..1)']
df["возможная долгосрочность клиента"] = df["важность"]*(df['возраст'].mean()-df['возраст'])

# ваш код тут
# Все, кто старше сорока:
print("Возраст хотя бы сорок лет: ", list(df[df['возраст'] >= 40]['имя']))
print("Доход выше среднего: ", list(df[df['доход'] > df['доход'].mean()]['имя']))
print("Имеет доход выше среднего, но надежность ниже среднего: ", list(df[(df['доход'] > df['доход'].mean())&(df['надежность клиента (0..1)'] < df['надежность клиента (0..1)'].mean()) ]['имя']))
df

Возраст хотя бы сорок лет:  ['Петя', 'Аня']
Доход выше среднего:  ['Петя', 'Аня']
Имеет доход выше среднего, но надежность ниже среднего:  ['Петя']

     имя  возраст   доход  ...  пол  важность  возможная долгосрочность клиента
0   Петя       45  100000  ...  муж   65000.0                         -763750.0
1   Вася       26   80000  ...  муж   59200.0                          429200.0
2    Аня       41  150000  ...  жен  130500.0                        -1011375.0
3  Света       21   60000  ...  жен   40800.0                          499800.0

[4 rows x 7 columns]

In [ ]:
# Task 3
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['low', 'medium', 'high'] * 3,
                    'price': np.random.randint(0, 100, 9)})
df2 = pd.DataFrame({'frukt': ['apple', 'banana', 'melon'] * 2,
                    'ves': ['low', 'high'] * 3,
                    'price': np.random.randint(0, 100, 6)})

# how inner = использовать пересечение ключей из обоих фреймов

pd.merge(df1, df2, how='inner', left_on=['fruit', 'weight'], right_on=['frukt', 'ves'])

   fruit weight  price_x  frukt  ves  price_y
0  apple    low       31  apple  low       39
1  apple    low       53  apple  low       39
2  apple    low       14  apple  low       39

In [4]:
# Task 4

import pandas as pd
import numpy as np

df = pd.DataFrame({
    'fruit': ['Apple', 'Watermelon', 'Cherry', 'Orange', 'Banana'],
    'price': [25, 33.5, 19.5, 9.6, 10],
    'quantity': [100, 34, np.NaN, 56, 120]})

# Посчитать сколько пропусков в датасете и удалить строки которые содержат пропуски
print(sum(list(df.isna().sum())))
df = df.dropna(axis=0, how='any')
#  Добавить новый столбец:
# Общая стоимость фрукта = количество на складе*цену за кг
df['total cost'] = df['quantity']*df['price']
print(df)
#Создать новый датасет, в котором содержать данные еще о трех фруктах:

df_new = pd.DataFrame({
    'fruit': ['Apple', 'Melon', 'Peach'],
    'price': [25.0, 30.0, 98.0],
    'quantity': [100, 55, 11]})
df_new['total cost'] = df_new['quantity']*df_new['price']
df.merge(df_new, how='outer')

1
        fruit  price  quantity  total cost
0       Apple   25.0     100.0      2500.0
1  Watermelon   33.5      34.0      1139.0
3      Orange    9.6      56.0       537.6
4      Banana   10.0     120.0      1200.0

        fruit  price  quantity  total cost
0       Apple   25.0     100.0      2500.0
1  Watermelon   33.5      34.0      1139.0
2      Orange    9.6      56.0       537.6
3      Banana   10.0     120.0      1200.0
4       Melon   30.0      55.0      1650.0
5       Peach   98.0      11.0      1078.0